In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("C:\\Users\\black\\Desktop\\PyforDS\\datasets\\patient.csv")

In [3]:
data.head()

,id,sex,birth_year,country,region,group,infection_reason,infection_order,infected_by,contact_number,confirmed_date,released_date,deceased_date,state
0,1,female,1984.0,China,filtered at airport,NaN,visit to Wuhan,1.0,NaN,45.0,2020-01-20,2020-02-06,NaN,released
1,2,male,1964.0,Korea,filtered at airport,NaN,visit to Wuhan,1.0,NaN,75.0,2020-01-24,2020-02-05,NaN,released
2,3,male,1966.0,Korea,capital area,NaN,visit to Wuhan,1.0,NaN,16.0,2020-01-26,2020-02-12,NaN,released
3,4,male,1964.0,Korea,capital area,NaN,visit to Wuhan,1.0,NaN,95.0,2020-01-27,2020-02-09,NaN,released
4,5,male,1987.0,Korea,capital area,NaN,visit to Wuhan,1.0,NaN,31.0,2020-01-30,NaN,NaN,isolated

In [4]:
data.isnull().sum()

id                     0
sex                 3894
birth_year          3920
country                0
region              3907
group               4136
infection_reason    4082
infection_order     4177
infected_by         4150
contact_number      4180
confirmed_date         0
released_date       4184
deceased_date       4199
state                  0
dtype: int64

In [5]:
data.replace(to_replace=["0"," ","NULL"], value=np.nan, inplace=True)

In [6]:
numeric_data = data.select_dtypes(exclude=["object"])

In [7]:
numeric_data.isnull().sum()

id                    0
birth_year         3920
infection_order    4177
infected_by        4150
contact_number     4180
dtype: int64

In [8]:
not_na_data = numeric_data.dropna()

In [9]:
not_na_data.shape

(15, 5)

In [11]:
numeric_data.dropna(axis=1).head()

   id
0   1
1   2
2   3
3   4
4   5

In [12]:
numeric_data.fillna(0).head()

   id  birth_year  infection_order  infected_by  contact_number
0   1      1984.0              1.0          0.0            45.0
1   2      1964.0              1.0          0.0            75.0
2   3      1966.0              1.0          0.0            16.0
3   4      1964.0              1.0          0.0            95.0
4   5      1987.0              1.0          0.0            31.0

In [13]:
mean_filled = numeric_data.fillna(numeric_data.mean())

In [14]:
mean_filled.isnull().sum()

id                 0
birth_year         0
infection_order    0
infected_by        0
contact_number     0
dtype: int64